[
{"link": "https://www.glassdoor.nl/job-listing/software-developer-effectory-JV_IC3064478_KO0,18_KE19,28.htm?jl=2756284857&ctt=1533887787257", "title": "Software Developer", "description": " Software Developer  Job descriptionDo you love technology?THIS IS YOUR JOB As a full stack Software Developer, you are part of one of our SCRUM teams working agile on our modern research platform, (responsive) questionnaires and dynamic client portal. Your software toolbox consists of Angular, Aurelia, Typescript, dotnet Core and Microsoft Azure. Together with the members of your SCRUM TEAM you focus on delivering qualitative code by using code reviews, test driven development, continuous integration and much more. Besides collaborating closely with our product owners, UI/UX specialists and tester, you also work with non-tech colleagues to improve the way they deliver to our clients. You develop yourself by continuous learning as well attending conferences, not to mention helping with and attending to our own meetups.RequirementsTHIS IS YOU Software is your thing: you love to soak up knowledge on the latest of the latest and see how we can apply it at Effectory, all in aim of improving the customer experience. You are a collaborator, initiator, problem-solver -- always eager get the best result. Though a higher-level degree (bachelor/academic) would be a great asset, you prove to be invaluable because of your interest, in depth knowledge and experience with the newest versions of C # / .Net, ASP.Net, ASP.NET MVC, Angular and Aurelia. But this is not enough: being the software geek that you are, you regularly read up on and learn about developments in software techniques relevant for Effectory and her clients. Last, but not least (and this is quite a list!): you know what it is to work agile, are familiar with T-SQL, can work in Visual Studio and GIT, can easily switch between web and Windows applications and have affinity with UI and UX. THIS IS US Effectory – Europe’s leading feedback specialist – is a thriving company with more than 150 entrepreneurial, young and ambitious professionals who help big and medium sized companies to collect feedback and ideas from their employees. Our mission is to work on making the working world better. Based in the center of Amsterdam, Munich and Cape Town, our multi-disciplinary and self-managing teams collaborate with more than 800 clients in ‘industries’ as varied as Retail, Production, Services and Non-Profit in over 70 countries.  Historically we have a strong foothold at the Dutch market which was our place of birth and we can't be stopped! To meet our growth ambition, we are determined to only hire eager and enthusiastic employees - both starters and experienced workers - who help infuse our business with even more energy. THIS IS WHAT WE OFFER While working from our wonderful office overlooking the Amsterdam canals (Cultural Heritage), you’ll have a front row seat in one of the most progressive thinking and mission driven companies -- but you won’t be sitting still. After you are onboarded to fully grasp your role in fulfilling Effectory’s mission, you can make use of extensive professional and personal development opportunities, on and off the job. And with hard work should come fun: Friday drinks, legendary office parties, our Annual Big Day, team sport initiatives like the ‘Dam tot Dam’-run, our own boat to cruise the canals of Amsterdam and an organic lunch served daily. That, topped with 25 days off plus a competitive salary and a fair piece of the profit-pie… need we say more?  Apply for this Job"},
{"link": "https://www.glassdoor.nl/job-listing/full-stack-software-developer-albelli-JV_IC3064478_KO0,29_KE30,37.htm?jl=2881710955&ctt=1533887787517", "title": "Full Stack Software Developer", "description": " DescriptionAre you the Full Stack Developer who will make our Customer Care Technology squad (CCTS) flourish by supporting the overall Care Departments’ strategic goals through the introduction of innovative technologies and modern practices? Then albelli is looking for you! Wherever you are in the world, we will happily help you with relocation right to the center of Amsterdam. Get in touch! Purpose As a Full Stack Developer for the Care Technology Squad you will have overall responsibility for delivering, integrating and maintaining high value Customer Care systems and tools. Together with the other members of your cross functional squad, you will be designing, building and maintaining robust, highly scalable, testable and maintainable technical solutions, APIs and services.  You will join a new and unique squad specifically focused on supporting the Customer Care Department by partnering with other operational teams to deliver the best customer journey. This by implementing best-in-class systems &amp; tools, using BI &amp; analytics to its’ fullest extent, and strive for constant innovation.  Main responsibilities: Design and develop robust, testable and maintainable software solutions;Sharing the responsibility for delivering high quality software with other team members and willing to closely collaborate (e.g. pair programming);Willing to show and demo your work to main stakeholders. Some of the initiatives to be worked on: Verint implementation &amp; optimization (Customer engagement system);Verint system integration (Looker, Slack, Jira, etc);Process automation: e.g. Chat bot possibilities;Set up and integrate modern Customer Care Backoffice platform;Automated reporting by using BI and Data analytics. RequirementsExcellent coding and design skills in JS, HTML and SCSS/CSS;Experienced with common JavaScript frameworks;Experienced in object-oriented programming/design;JSON and Rest API integration experience;Effective communication in English (speaking and writing) is a must. Desirable: Knowledge of UX and UI implementation skills;Experience with Microsoft web technologies (ASP.NET MVC or Web API);Experience with relational and NoSQL databases;Experience with Continuous Delivery, TDD, BDD, DDD;Experience with Customer Service solutions such as online Chat, Email Ticket systems and/or Chatbots;We offerA fast growing eCommerce environment;An international office hosting over 30 nationalities;Competitive compensation and lots of benefits;A social atmosphere (lunch, Friday drinks, parties, sports, etc.);An informal, fun and driven culture;A central location in one of Europe’s most vibrant cities."},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-payments-booking-com-JV_IC3064478_KO0,27_KE28,39.htm?jl=2796089845&ctt=1533887787488", "title": "Software Developer - Payments", "description": "B.Responsible: As a Software Developer in our Payment department, you are responsible for the development, performance, and scaling of our payments platform, as well as internal systems related to the platform. You will work independently and will also be responsible for making technical decisions within a team.  Important aspects of the job include: Rapidly developing next-generation scalable, flexible, and high-performance payments platform.Solving issues with the site and internal systems, prioritizing based on customer impactActing as an intermediary for problems, with both technical and non-technical audiencesMost products are developed in Perl and JavaContributing to the growth of Booking.com through interviewing, on-boarding, or other recruitment effortsB.Skilled We are looking for driven Developers who enjoy solving problems, who initiate solutions and discussions and who believe that any challenge can be scaled with the right mindset and tools.  We have found that people who match the following requirements are the ones who fit us best: Minimum of 3 years software development experience using JavaExperience with other languages like Perl, Go, Python, Scala, C++ etc is a plus2+ years experience building consumer e-commerce or payments platforms at scale2+ years of experience working in the Payments domainPrevious experience with distributed systemsHands on experience of developing in and contributing to open source data technologies, such as HadoopDemonstrable experience with MySQL and PostgreSQL or similar relational databasesExperience of working on products that impact a large customer base is an advantagePreferably a university degree in Mathematics or Software EngineeringExcellent communication; written and spokenB.offeredHeadquarters located in one of the most dynamic cities in Europe: AmsterdamPerformance-based company that offers 26 vacation days, career advancement, and lucrative compensation, including bonuses and stock potentialDiscount on Booking.com accommodations with the Booking Deal including other perks and benefitsCompany-sponsored family and social activities to help our employees become integrated with each other and Dutch cultureDiverse and creative colleagues from every corner of the worldGenerous relocation package, ensuring a smooth transition to working and living in Amsterdam"},
{"link": "https://www.glassdoor.nl/job-listing/software-engineer-aprimo-JV_IC3064478_KO0,17_KE18,24.htm?jl=2722184818&ctt=1533887787560", "title": "Software Engineer", "description": "Job Title: Software  Engineer Location: Amsterdam, NL Hours: ~40Must be eligible to work without requirement of future sponsorship for employment Visa status.About the RoleAs a Software Engineer on our Amsterdam Aprimo  R&amp;D team, you’ll be building web applications that make our customers more  productive. You’ll be part of an agile  team, working in quick iterations to produce an exciting next-generation  product using best-practices like RESTful web services and responsive design.  You will need to be strong technically as well as be able to work well in an  agile team environment. Great teamwork,  leadership and communication skills are a must. About You Experience  you will have:5+ years in Software  EngineeringBachelor’s Degree in business  or computer-related disciplineExperience with C# .NET or  another high-level programming languageStrong JavaScript experienceExperience with SQL Server or  other RDBMSASP.NETThe ability to multi-task on  various projectsA desire to learn, grow and  work with a team in an agile environmentStrong teamwork, time  management, and communication skillsExcellent object oriented  design skillsThe successful  candidate will:Work  within an agile team (Product Owner, Scrum Master, Developers, Agile Testers)  to prototype, design and deliver great features on-time for a web-based  SaaS applicationWork  as a full-stack application developer capable of delivering UI, APIs,  business logic, data access features using Microsoft technologiesEmploy  a dev ops approach to software development, enabling successful deployment  and monitoring of customer usageCoordinate  with Architects and Principal Engineers on optimum designImplement  3rd party libraries and integrate with 3rd party  systemsMaintain  and enhance existing product functionalityPerform  and participate in code reviews and deliver features with automation testsStrongly  Preferred:Experience building an enterprise-level web  applicationExperience with Microsoft Azure idealProduction-level JQuery, TypeScript, React  experienceExperience with HTML5, CSS3, and responsive  designExperience implementing RESTful web servicesUnit Testing/Automation experienceAbout AprimoAprimo is a category-leading marketing operations platform that  frees marketers to focus on smart marketing by automating the five  essentials: planning, spending, creation, distribution, and  performance. Aprimo’s comprehensive suite improves time-to-market and  maximizes a company’s marketing investment to drive revenue. Aprimo is headquartered  in Chicago, with global R&amp;D on multiple locations around the globe  including Amsterdam, NL. For more information visit www.aprimo.com. Mission: To empower marketers to reach their full potential and continuously  deliver value back to their organizations.  We are an equal opportunity employer and all  qualified applicants will receive consideration for employment without regard  to race, color, religion, sex, national origin, disability status, or any other  characteristic protected by law."},
{"link": "https://www.glassdoor.nl/job-listing/software-engineer-backend-developer-perform-group-JV_IC3064478_KO0,35_KE36,49.htm?jl=2879980230&ctt=1533887787560", "title": "Software Engineer (Backend Developer)", "description": " Job Details Department: Software DevelopmentJob Title: Software Engineer (Backend Developer) (NET0051)Reports to: Software Engineering ManagerLocation: Amsterdam, NetherlandsHours of Work: 37.5SO WHAT’S YOUR NEW ROLE ABOUT? The Backend Engineer will be contributing to the development and delivery of the backend APIs of our DAZN product, developing new features and launching new platforms. A successful candidate will have a proven ability in delivering highly scalable backend applications, a desire to work in a fast paced, Agile software development environment and a passion for building a world class product. DAZN are going to change the way people watch sports forever, by putting the consumer first, providing more sport, no ads, no long contract and a single low monthly fee. As part of the DAZN tech team, you will play a lead role in this by designing and building world leading streaming services across web, mobile and TV platforms, working on new feature releases and evolving the next phase of our application framework. With a rapidly expanding company; growth within the team and opportunities to lead engineering initiatives are abundant. We need people who want to help us build a strong engineering culture and a fun, vibrant workplace. WHAT WILL YOU DO IN YOUR NEW ROLE?Deliver high quality, robust and testable code adhering to internal engineering procedures, code conventions and development methodologies.Work to continually improve software deployment to ensure iterative releases and rapid deployment of updates to our customers across all platforms.Monitor system performance and resolve any issues or failures in staging or production environments.DO YOU HAVE THESE ESSENTIALS TO BE CONSIDERED FOR AN INTERVIEW?Expertise in Node.js or other modern programming language (memory profiling, debugging).Understanding the nature of asynchronous programming and its quirks and workarounds.Knowledge about automated build processesDesign and implementation of low-latency and high-availability applications.Ability to write unit tests.DO YOU HAVE THESE DESIRABLES?Understanding the fundamental design principles behind a scalable application.Understanding of distributed systems and the difference between microservices and Message Driven Architecture.Experience with at least one SQL/noSQL database.Experience with AWS, AWS Lambda, Docker, Kubernetes.Experience of working in an Agile software development environment.THESE ARE THE PERFORM/DAZN COMPETENCIES YOU’LL NEED TO SUCCEED IN YOUR ROLE….Learn and Grow; On-going drive for learning and ability to apply new knowledge and skills Teamwork &amp; Collaboration; Working collaboratively with a group of people in order to accomplish a task or achieve a goal. Drive &amp; Energy; Self–motivated and driven to succeed, focused on results and passionate about the job. Creativity &amp; Innovation; Ability to generate and translate an idea into a product or service that creates value for business. HERE’S A LITTLE MORE ABOUT US At Perform Group we like to consider ourselves a progressive, dynamic, fun and fast-paced global sports media broadcasting company. We are passionate about what we do and good at it too! We have over 2,800 employees with an extensive network of freelance specialists. We have a strong team with experts from Netflix, Prime Video, BBC iPlayer, YouView and Now TV. We’re growing rapidly and launching into new global markets every year. DAZN is our sports streaming service that allows fans to watch their sport, their way, live or on-demand. With access to the world’s best sports, fans can watch their favourite teams, leagues and players anytime, anywhere, for one simple, affordable price and with no long-term contract. DAZN has over 8,000 live events a year and features the widest array of live sports ever offered on one TV service. DAZN can play, pause and rewind anytime with no commercial interruptions and no long-term commitments.  DAZN is currently available in Canada, Germany, Austria, Switzerland and Japan on most connected devices including Smart TVs, smartphones, tablets and games consoles. DAZN is set to launch in Italy in August 2018 and the United States in September. Find out more atwww.performgroup.comhttps://engineering.dazn.com/http://media.dazn.comTHE BENEFITS YOU WILL ENJOY WHEN YOU JOIN WILL INCLUDE…25 days’ annual leave (increasing by 3 days after 3 years), defined contribution pension scheme, Travel Cost Assistance. And there’s more…… you’ll have access to the Perform/DAZN online learning portal (MindTools) and be part of our Career Deal, which aims to support your continued professionaldevelopment. We also have a structured management development programme and a financially rewarding ‘Refer a Friend’ scheme. Now that you’ve made the effort to read about this great opportunity – click apply!! Remember to review more fantastic opportunities on our careers page and start your adventure at PerformAPPLY HERE"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-deloitte-JV_IC3064478_KO0,18_KE19,27.htm?jl=2615724608&ctt=1533887787513", "title": "Software Developer", "description": " Jouw functie: Software DeveloperEen software developer bij Deloitte Digital is een ijzersterke technische specialist die energie haalt uit het neerzetten van (complexe) IT oplossingen die de business van de klant effectief kunnen ondersteunen. Hiermee heb je aantoonbare ervaring in het technische domein, kennis van architectuur en IT visie.Wat ga je doen?Als software developer bij Deloitte Digital krijg je te maken met een jong enthousiast team die van hun werk houden en daar energie uit halen. Denk hierbij aan de werkzaamheden die horen bij het geven van advies op technische vraagstukken en begeleiden van de uiteindelijke realisatie. Je zal advies geven aan toonaangevende publieke en private cliënten op het snijvlak van business en IT.  Je werkt vaak op locatie bij de klant en in staat om ontwikkel trajecten volledig zelfstandig op te leveren. In de praktijk ben je bezig met het ontwerpen en implementeren van complexe high level IT-strategieën, technische architecturen, business intelligence maar ook maatwerk systeemontwikkeling. Behalve betrokkenheid bij het adviestraject krijg je als senior een leidende rol in ontwikkeltrajecten. Dat betekent dat je verantwoordelijk zal zijn voor de planning, architectuur beslissingen, realisatie en begeleiding biedt aan collega’s.  Daarnaast biedt Deloitte Digital veel mogelijkheden om jezelf verder te ontwikkelen. Je kan dan ook mooie stappen maken voor de rest van je carrière!Wat is je rol binnen Deloitte?Deloitte Digital biedt totaal oplossingen voor business vraagstukken. Daarom zal het team waarin je werkt vaak multidisciplinair zijn. Vaak werk je samen met andere Deloitte collega’s, maar ook met specialisten van de klant of andere externe partijen. Een paar voorbeelden van dit soort projecten zijn: Design, ontwerp, realisatie en (organisatorische) implementatie van een responsief web portaal voor ondernemers.Design, ontwerp, realisatie en implementatie van een high-performance zoekmachine met meer dan 4 miljoen records.Design, ontwerp, realisatie en implementatie van een groot online community voor ondernemers.Realisatie en implementatie van een zoekmachine voor het oplossen van problemen binnen een netwerk verspreid over 20 landen.Design, ontwerp, realisatie en implementatie van een groot e-commerce platform, bij een groot internationaal bedrijf, met als doel de online sales makkelijker en beter te makenGuido ging je voor: “Na een aantal jaren ervaring als Full-STACK developer, ben ik in januari 2013 bij Deloitte Digital komen werken. Ik kon snel aan de slag bij een grote klant die internationaal opereert. Ik heb samengewerkt met verschillende collega’s uit andere disciplines en andere internationale kantoren. Uiteindelijk heb ik allerlei functies gehad binnen verschillende projecten. Van front-end/back-end ontwikkelaar tot scrum master of architect. Voor ieder project jezelf weer opnieuw moeten uitvinden, houd me scherp en maakt het nooit saai.  Andere leuke dingen zijn de mogelijkheden die je hebt, om jezelf verder te ontwikkelen door middel van trainingen en hackathons die georganiseerd worden op gebieden als IoT, VR, Mobile of Web. Het is heel erg gaaf om te zien wat je met een team binnen 1 dag kan realiseren voor klanten of intern.  Dit in combinatie met leuke collega’s en alle ervaringen die ik op doe maken Deloite Digital voor mij de perfecte werkgever!”  Voor meer informatie, kijk op de Deloitte Digital Instagram pagina! Wie ben jij? Ben je klantgericht en geïnteresseerd in nieuwe technologieën? Heeft bovenstaande omschrijving je interesse gewekt? Bij twee keer JA, maken wij graag kennis met jou! Daarnaast voldoe jij aan de volgende voorwaarden: Je beschikt over een afgeronde HBO en/of WO opleidingJe hebt 3+ jaar relevante werkervaringJe hebt gedegen programmeer kennis in een OO taal zoals Java of .NETKennis/ervaring met HTML/CSS/JSKennis en ervaring met een uiteenlopende set tools.  Denk hierbij aan : MVC, RESTful, AngularJS, (No-)SQL, NodeJS, Maven.Je bent communicatief vaardig en in staat om samen met diverse afdelingen van een klant tot goede oplossingen te komen.Kennis en ervaring met methoden als Agile/Scrum, Prince2, TDDJe hebt benieuwd naar het aanleren in van nieuwe technieken en bij te blijven met de veranderingen op technisch gebied.Je bent resultaatgericht maar verliest daarbij kwaliteit niet uit het oog.Je spreekt vloeiend Nederlands en/of Engels. Waarom zou je voor Deloitte Digital moeten kiezen?Deloitte Digital combineert het beste van beide werelden. Deloitte Digital is jong, snel, energiek en hip. We doen gave projecten voor indrukwekkende klanten. Er is ruimte om stappen te maken in je carrière, zowel in de breedte als de diepte. Naast het werk doen we natuurlijk ook graag leuke dingen: Regelmatig LAN-party’s, met alles wat daarbij hoortHackathons over de meest uiteenlopende technieken.All-inclusive skivakantie met collega’sVrijdagmiddagborrelsWerken in het meest duurzame en innovatieve pand ter wereld! Aarzel niet om contact met ons op te nemen als je vragen hebt en/of solliciteer snel via onderstaande button.Word jij uitgedaagd door deze functie?Neem dan vandaag nog contact met ons op voor een kennismaking. Klik op onderstaande button en vul je gegevens in.  Past de geschetste functie niet bij jou, maar ken je iemand die perfect in het geschetste profiel past? Stuur deze vacature dan door.  Voor vragen over deze vacature kun je bellen met Simone van Dooren op telefoonnummer 0682019261. Acquisitie op basis van deze vacature wordt niet op prijs gesteld."},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-laborie-medical-technologies-JV_IC3064478_KO0,18_KE19,47.htm?jl=2855735867&ctt=1533887788188", "title": "Software Developer", "description": " LABORIE Medical Technologies seeks a Software Developer to join our talented team of developers. If you have a passion for innovation and you are looking for a rewarding opportunity to make a difference in the world of healthcare, please read on to learn more about our rapidly growing company and the life-changing work we do.  As a Software Developer, you will contribute to the architecture, design, development and testing of the LABORIE software platform used by hospitals and clinics worldwide. You contribute to solutions to provide better diagnostics and treatment outcomes to patients worldwide. You will be responsible for the integration of software systems over the course of the full product development life cycle. Essential FunctionsResponsible for design, development, testing and maintenance of LABORIE diagnostic software on Windows environment.Responsible for documenting the software design in the Software Architecture and Design Documents.Responsible for software development and unit-testing according to regulatory and company standards.Responsible for guidance of fellow software developers.Assisting in the collection and documentation of the software development plan, software configuration plan and software work instructions.Responsible for maintaining high standards of software quality.Self-training on any existing and new technologies as well as on company standardsSkills &amp; Qualifications2-3 years software development experience.Diploma or degree in Computer Science.Delphi knowledge and experience.Solid track record of designing and developing production ready software, knowledge of software implementation best practices.Ability to work both independently and collaboratively in a team setting.Ability to quickly learn new technology and apply knowledge to solve technical and business problems.Strong problem solving / analytical skills.Willing to gather medical domain knowledge on Gastrointestinal diagnostics.Strong verbal and written English skills.Our offer At LABORIE, you will work in a supportive work culture every day. You will share information and work closely together in an international team. LABORIE offers competitive compensation, benefits, many opportunities for career advancement, product training and significant on-the-job training. You will be working with high-end equipment. Your workplace will be located in Amsterdam, The Netherlands.  If this sounds like you, please apply with your resume and cover letter. If this sounds like someone you know, please feel free to share this vacancy. For any questions, please contact our location in Enschede. About LABORIE LABORIE, (www.LABORIE.com) is a leading global developer, manufacturer and marketer of medical technologies and devices. We deliver innovative Urological and Gastrointestinal products that improve patients' health and quality of life. Our reputation and brand continues to be the \"gold standard\" in our industry.  In business since 1967, LABORIE proudly serves the global market with its European headquarters located in Enschede, The Netherlands. Our global reach extends to 11 offices, in 10 countries and our manufacturing facilities are located in Mississauga, Montreal, USA, The Netherlands and Switzerland. Working closely with clinicians, universities, and non-profits around the globe, we make a difference worldwide. Please visit our website for more information."},
{"link": "https://www.glassdoor.nl/job-listing/software-engineer-picnic-JV_IC3064478_KO0,17_KE18,24.htm?jl=2859520258&ctt=1533887788035", "title": "Software Engineer", "description": "Picnic is an app-only supermarket. Were data driven with software at our core. Our world-class developers write immaculate code to support the worlds fastest growing supermarket. Were on a quest for like-minded people to be part of the future of digital grocery shopping.Where you fit inOur developers are integrated, involved, and essential to each part of our company. From route planning, scaling our customer analytics to handle millions of messages, to how many bananas we should have in our warehouse on a Thursday they write, plan, and predict.  As one of our Java Developers, you take ownership of projects, learn, and work collaboratively with your colleagues. You constantly design, test, evolve, and evaluate the nuts and bolts of our operation while offering a creative and analytical approach.  The high-quality code that stems from your fingertips is stylish, sexy, and robust. You just love to build ultra-scalable systems. Youre at home writing platforms and you display an intricate understanding of how each line of code fits into a business plan.  Your skills will be complemented with the latest tech. We are committed to pushing development wherever possible. When you arrive youll be working with Java 8, but soon youll help us make the transition to Java 9.  At Picnic we have diverse projects to keep you interested. Think you should focus on Android development? Thats fine - youll have the freedom to experiment and evolve your own abilities.  We dont hide our developments. We open-source with the community that helped us grow. If you require more motivation to apply - check out our page: http://picnic.techWhat you doDesign, develop, and test new user-facing features of our platformCreate high-quality code that is scalable, reliable and reusableInnovate and advance the core planning, shopping, retailing and shipment algorithmsOptimise supply chain systems to maximize operational performance and efficiencyAnalyse and improve the scalability and security of our platformManage individual project priorities, deadlines and deliverablesWhat you needBachelors Degree in Computer Science or related technical field1-3 years experience in Programming and Software DevelopmentProfound understanding of back-end development (Java, Spring MVC, MongoDB, Elastic, PostgreSQL)Critical thinking and initiative: Hands-on, nothing-is-impossible mindsetMental athleticism: Highly analytical and curious intellectOut-of-the-box thinking: Ability to translate business requirements into high-performing scalable solutionsSuperb communication: Capacity to articulate technical problems and projects to all teamsTechnologies we useJava 8 (RxJava and Spring), Python, JavaScript (TypeScript)ElasticSearch, RabbitMQ, KinesisNPM, Yarn, WebpackMaven and GitPostgreSQL (PostGIS), MongoDB, Redshift (Spectrum), AthenaHadoop, Spark, Elastic MapReduce (EMR)AWS, Docker, Kubernetes, Kops, Terraform, Vault, Packer"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-e-village-JV_IC3044891_KO0,18_KE19,28.htm?jl=2887070574&ctt=1533887788104", "title": "Software Developer", "description": " Software DeveloperHeb jij de kennis en de drive om samen met ons te bouwen aan de beste e-mailmarketingapplicatie van Nederland (Emerce top 100 lijst)? Kan jij niet alleen mooie features bedenken maar deze ook omzetten naar gebruiksvriendelijke software? En heb je altijd al willen werken voor grote A-merken? Dan maken wij graag kennis met jou! Omschrijving functie &amp; bedrijfWe zoeken per direct een medior / senior Software Developer die bij kan dragen aan de (door-)ontwikkeling van ons volledig in-house ontwikkelde marketing automation en e-mailmarketingsoftware Clang. Als Software Developer denk je proactief mee in de verbetering van Clang én je bent een interne vraagbaak voor collega's. We werken continu aan de optimalisering van de software, deliverability en dienstverlening aan de hand van marktontwikkelingen en specifieke klantwensen, innovaties in techniek, softwareontwikkelingen en trends in de markt. En hiervoor hebben we mensen nodig die van afwisseling in het werk houden en kennis van zowel front- als back-end technieken hebben. Dus lekker uitdagend en innovatief! Jij vertaalt de interne opdrachten naar overzichtelijke software en draagt daar waar nodig kennis over aan jouw collega's. Je levert een belangrijke bijdrage om onze applicatie de leidende in Nederland te houden op het gebied van e-mail en event driven marketing. Je werkt in een team van absolute codetoppers en je maakt gebruik van Docker, CI/CD, Microservices. Je komt te werken bij een awards winning full service e-mailmarketingbureau (Emerce top 100 lijst). Als Marketing Solution Provider met eigen e-mailmarketingsoftware helpen wij klanten de effectiviteit van hun marketingcampagnes en klantcontactmomenten te verhogen. Met een team van ruim 70 experts staan wij dagelijks klaar voor opkomende spelers en prominente merken uit alle branches waaronder Transavia, Eneco, Greetz, Shell en KWF.Wij vragenJij bent iemand die actief bezig is met nieuwe technologieën, (heel) goed is met PHP7, MySQL, JavaScript (ExtJS) en bekend bent met Git. Daarnaast ben je goed in het zelfstandig omzetten van abstracte concepten in overzichtelijke software, gewend om volgens de scrummethodiek te werken, vindingrijk en creatief. Je hebt ongeveer 3 jaar ervaring als PHP Developer. Je specs zijn: intelligentie, gedegen technisch inzicht en ervaring met webdesign en OOP.  Je hebt een streepje voor als je kennis van en ervaring met Linux hebt. Wij bieden:Een uitdagende baan met veel vrijheid en zelfstandigheid en een overzichtelijk team met leuke en vakkundige collega's. We know you’re not joining only for the financials, but we do offer a few good perks:Een uitstekende beloning die afhankelijk is van kennis en ervaring;Per direct een betrouwbaar contract met aantrekkelijke secundaire arbeidsvoorwaarden zoals een collectieve zorgverzekering, pensioen, 25 vakantiedagen, een laptop en telefoon, onkostenvergoeding etc.;Volop mogelijkheden om jezelf te ontwikkelen, opleidingsbudget, kennissessies en in-house Clang trainingen;Lekkere koffie, fruit en een heerlijke lunch;Regelmatig gezellige bedrijfsuitjes, maandborrels, kwartaallunches en spelletjesavonden.Interesse? Let us know! Stuur je cv naar vacatures@e-village.nl onder vermelding van: Vacature Campaign Developer. Of neem direct contact op met Viktoria Schildwacht via 030 698 16 90 of v.schildwacht@e-village.nl.Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld. Cv's die door bureaus ongevraagd worden gepresenteerd zullen niet in behandeling worden genomen en er kunnen ook geen rechten aan worden ontleend."},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-fulltime-itprogrammeur-JV_IC3064478_KO0,27_KE28,41.htm?jl=2843162161&ctt=1533887788517", "title": "Software Developer FullTime", "description": " For our client in Amsterdam we are looking for self-starters who are great at solving real life problems.  Responsible  As a Software Developer, you are responsible for the development, performance, and scaling of our public website as well as internal systems. You will work independently and will also be responsible for making technical decisions within a team.  Important aspects of the job include:  Rapidly developing next-generation scalable, flexible, and high-performance systems.  Solving issues with the site and internal systems, prioritizing based on customer impact  Acting as an intermediary for problems, with both technical and non-technical audiences  Testing; we run thousands of experiments running at one time. We built one of the most advanced A/B testing platforms in the industry.  Most products are developed in Perl, but not all. Perl is very effective when it comes to rapid prototyping, which our product development teams do a lot of. It’s not necessary to know Perl before you start, but it helps. We are not just using the language, we influence the future of the language.  Skilled  We are looking for driven Developers who enjoy solving problems, who initiate solutions and discussions and who believe that any challenge can be scaled with the right mindset and tools.  We have found that people who match the following requirements are the ones who fit us best:  Minimum of 3 years software development experience; using 2 or more server side programming languages. Preferably Perl, Java, Python, Scala, C++ etc.  Previous experience with distributed systems  Hands on experience of developing in and contributing to open source data technologies, such as Hadoop  Demonstrable experience with MySQL and PostgreSQL or similar relational databases  Experience of working on products that impact a large customer base is an advantage  Preferably a university degree in Mathematics or Software Engineering  Excellent communication; written and spoken  We offered  Headquarters located in one of the most dynamic cities in Europe: Amsterdam  Performance-based company that offers 26 vacation days, career advancement, and lucrative compensation, including bonuses other perks and benefits  Company-sponsored family and social activities to help our employees become integrated with each other and Dutch culture  Diverse and creative colleagues from every corner of the world  Generous relocation package, ensuring a smooth transition to working and living in Amsterdam"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-onguard-JV_IC3064478_KO0,18_KE19,26.htm?jl=2710018446&ctt=1533887788900", "title": "Software Developer", "description": "Software DeveloperFulltimeEducation level: Bachelor degreeExperience in years: 2+ experience in programming within functionally rich software applicationsLocation: Amsterdam Zuidoost"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-bright-computing-JV_IC3064478_KO0,18_KE19,35.htm?jl=1829126085&ctt=1533887788344", "title": "Software Developer", "description": " Software Developer By Femke Burgerjon | Feb 10, 2016 11:52:08 AM | LOCATION:AMSTERDAM Job DescriptionWe have positions available for enthusiastic and experienced software developers for the development of our Linux-based cluster software environment. You will be part of a team responsible for the development of our Linux based cluster management software.There will be ample opportunity to develop your skills and to take initiative. You will have the opportunity to work with the latest hardware (e.g. GPUs, Xeon Phi and high-speed interconnects such as InfiniBand, Omni Path and 40 Gig-E) and software technologies such as parallel filesystems (e.g. Lustre, GPFS, BeeGFS), Hadoop, Spark, OpenStack, Docker, Kubernetes, Puppet, Open vSwitch and Ceph. Our development team consists of highly skilled developers that are passionate about building a software product that meets our customers' needs today and in the future. With your help, we will be adding many new features to our product to allow Bright clusters to be used for a wider range of workloads, and to allow clusters to scale to hundreds of thousands of nodes (i.e. exascale). We will also target new CPU architectures such as ARM64 and Power8/9, and further integrate container technology into the product to allow workloads to scale up and down easily on-premise, and to public clouds.Required and Desirable Skills Programming You are fluent in C++ and intimately familiar with object oriented software design, design patterns, and concurrent programming techniques. The quality of your work is important to you, so you take pride in producing extremely clean code. Furthermore, you are eager to learn and use new technologies.Knowledge of Python, databases (SQL and NoSQL), JSON, XUL, Javascript, AngularJS, OpenStack, Hadoop, Spark, and distributed programming would be beneficial, but is not strictly necessary. Linux Our cluster management software is based on Linux. You should be very familiar with the Linux operating system and in particular with networking concepts in Linux. In addition, you are familiar with the most common software that is part of a typical Linux installation. General Skills Bright Computing is a young but rapidly growing company. We require people who are not only very skilled, but who are also flexible, reliable, can take initiative, can deal with responsibility, and have a \"can do\" mentality.OverviewLanguages: EnglishEducation: Bachelor's in computer science or related, Master's degree or PhD preferredExperience: &gt;2 yearsSalary: Depending on skills, qualifications and experienceBenefits: Normal company benefitsHours: Full timeStarting: ASAPLocation: Amsterdam, The Netherlands More Information Femke Burgerjonjobs@BrightComputing.com"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-booking-com-JV_IC3064478_KO0,18_KE19,30.htm?jl=2875915549&ctt=1533887788236", "title": "Software Developer", "description": " At Booking.com we combine the best traits of a start-up with the resources of planet Earths #1 accommodation website. We are working towards building the ultimate travel experience, building and improving great products for both travelers and the accommodation partners  Booking.com is looking for self-starters who are great at solving real life problems.  We offer an international, diverse, fun, and dynamic environment. If scale and complexity excite you, Booking is the place to B! B.responsible As a Software Developer, you are responsible for the development, performance, and scaling of our public website as well as internal systems. You will work independently and will also be responsible for making technical decisions within a team.  Important aspects of the job include: Rapidly developing next-generation scalable, flexible, and high-performance systems.Solving issues with the site and internal systems, prioritizing based on customer impactActing as an intermediary for problems, with both technical and non-technical audiencesTesting; we run thousands of experiments running at one time. We built one of the most advanced A/B testing platforms in the industry.Most products are developed in Perl, but not all. Perl is very effective when it comes to rapid prototyping, which our product development teams do a lot of. Its not necessary to know Perl before you start, but it helps. We are not just using the language, we influence the future of the language.Contributing to the growth of Booking.com through interviewing, on-boarding, or other recruitment effortsB.skilled We are looking for driven Developers who enjoy solving problems, who initiate solutions and discussions and who believe that any challenge can be scaled with the right mindset and tools.  We have found that people who match the following requirements are the ones who fit us best: Minimum of 3 years software development experience; using 2 or more server side programming languages. Preferably Perl, Java, Python, Scala, C++ etc.Previous experience with distributed systemsHands on experience of developing in and contributing to open source data technologies, such as HadoopDemonstrable experience with MySQL and PostgreSQL or similar relational databasesExperience of working on products that impact a large customer base is an advantagePreferably a university degree in Mathematics or Software EngineeringExcellent communication; written and spokenB.offeredHeadquarters located in one of the most dynamic cities in Europe: AmsterdamPerformance-based company that offers 26 vacation days, career advancement, and lucrative compensation, including bonuses and stock potentialDiscount on Booking.com accommodations with the Booking Deal including other perks and benefitsCompany-sponsored family and social activities to help our employees become integrated with each other and Dutch cultureDiverse and creative colleagues from every corner of the worldGenerous relocation package, ensuring a smooth transition to working and living in Amsterdam Apply!"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-nielsen-JV_IC3065472_KO0,18_KE19,26.htm?jl=2763673732&ctt=1533887788033", "title": "Software Developer", "description": "Software Developer - 14060 Technology and Engineering - Netherlands Diemen, North Holland  €1,000.00  Role objectives  This position is responsible for analyzing, developing, testing, and supporting highly complex in-house data coding application software and services in C#.NET and PLpgSQL / Postgres. These software applications and ETL processes must be developed and maintained with high-quality standards and minimal defects. These data coding/ETL software applications are used within Nielsen Watch business to code and analyze advertisement related data.  Responsibilities: Develop highly complex in-house data coding software applications (Rich - Clients) and services, which are maintainable, easy to use, and satisfy application requirements.Conduct and participate in technical reviews of highly complex software, evaluating the proposed technical solutions and recommending appropriate revisions for efficiency and maintainability.Close cooperation with product owner and stakeholders.Coordinates support to internal users and support staff by investigating application incidents for missing or incorrect functionality and by assessing and applying incident resolutions leading to timely, error free revisions in applicationsWork as team member in a Scrum team Requirements: Bachelor’s degree in computer science or equivalent work experience.Very good C # (Windows Forms / WPF) / .NET framework - knowledge. Preferred experience of three years or more in .NET Windows software developmentSeveral years of experience with relational databases, preferred with PostgresGood knowledge in OOD (modeling, design and development)Very good understanding of data structures and algorithmsVery good English skills (written and spoken). Other EU languages like Dutch/German skills are a plusExpert ability to apply analytical and problem-solving skills to solve complex design and coding problems.Good interpersonal skills.ReliabilityGood team worker, preferable experience with ScrumExperience with Amazon cloud solutions is a plusJob Type: Regular Primary Location: Diemen,North Holland Secondary Locations: , , , Travel: Yes, 15% of the Time Relocation Approved: No Hiring Manager Name: Volker Stapelmann Hiring Manager Title: MEDIA PRODUCTION REGION L Recruiter Name: Bianca Aranka Roode"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-rijksoverheid-JV_IC3055744_KO0,18_KE19,32.htm?jl=2871332954&ctt=1533887789180", "title": "Software developer", "description": "Functie­omschrijving(actief)Background Climate change research and innovations in weather forecasting and seismology rely more and more on IT and data. Besides the traditional data infrastructures such as observation networks, radars and satellites, the use of data from other domains, open data, crowd sourced data and IoT data are emerging.  In collaboration with public and private sector partners, the KNMI Data Technology group performs research and development in leading edge web services and products, using (Big) data management and processing, data analytics, web technology and data visualization techniques for the KNMI domains. Some tags: Open Source, Linux, Cloud, Docker, React, GitHub. Your challenge You will work as software developer on IT innovations dealing with large and real-time data, providing useful information to the operational offices like the KNMI weather-room, researchers, private sector and general public. Part of the challenge: security and robustness, performance, scalability, CI/CD, metadata and provenance.  You will be a member in one of the Data Technology Agile teams: the GeoWeb Team, developing the next generation weather visualization and production application. Creativity and craftsmanship are essential. As a team player you contribute to the inspiring working environment.  We work in a Unix/Linux environment and have a strong preference for using Open source and Open standards.  Since we have numerous projects with (international) institutes and attend conferences you will probably have a few business trips per year.Functie-eisenHere is what we expect from you: a college or university degree in Computer Science or similarfluency in one or more programming languages (e.g., Java, C++, JavaScript, Python)fluent in speaking and reading English  What we welcome:experience as a full stack developermulti-disciplinary team experienceexperience with OGC web services (WMS, WCS, WPS, WFS), Unix scripting, (no)SQL or OPeNDAP would be an advantageinterested in weather, climate and seismology applications  Specific training in these areas can and will be done on the job, but passion in software development craftsmanship and continuously improving yourself are essential for this job.Arbeids­voorwaardenSalaris­niveauschaal 10Maand­salarisMin €2.631 – Max. €4.229 (bruto)Dienst­verbandTijdelijke aanstelling voor de duur van project / traject / werkzaamhedenContract­duurTemporarily position for the duration of three yearsMinimaal aantal uren per week36Maximaal aantal uren per week36Overige arbeids­voorwaardenIn addition to the salary and holiday pay, you can expect to receive an end-of-year payment, the so-called ‘13th month’. The national government strongly adheres to personal growth and career development and offers several opportunities to facilitate this. The terms of employment include, amongst other things, a maximum of 55% paid parental leave (conditions apply), facilities to study, an additional leave plan for older employees and reimbursement of commuting costs. Moreover, the national government also offers a range of options to shape your total employment package based on individual choice.BijzonderhedenTemporary position for the duration of three years."},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-credit-tools-JV_IC3064478_KO0,18_KE19,31.htm?jl=2645799583&ctt=1533887788120", "title": "Software Developer", "description": "Software DeveloperAt Onguard wecontinuouslywork on new innovations to the Onguard software in order to help professional international companies to improve their credit management processes. We strive to provide customers with optimal support by providing the best software and services. You can contribute to this process! To strengthen our Development team in Amsterdam Zuid Oost, we are looking for developers with the ambition to grow in either front-end, back-end, middleware or DevOps.  Do you have the ambition to develop yourself in your desired field of expertise? We give you the opportunity to get together with colleagues to gain knowledge of software development. With your Onguard colleagues, you can continuously make the difference for our world leading and innovative credit management software and our customers. We offer you sufficient space to develop yourself in our professional organisation in Amsterdam Zuid Oost.  The team you work in is a small multidisciplinary scrum/agile team. The project has a tight timetable and must meet a high-quality level. Our offerOpportunities for personal development and to specialize (further) in software developmentActive participation in the development of the Onguard softwareYour own set of tasks and responsibilitiesExcellent primary and secondary benefitsJob requirementsBachelor degreeKnowledge in the following areas would be beneficial: C#, HTML, CSS, JavaScript and SQLExperience or ambition to specialize in either Front End, Middleware, Back End, DevOpsExperience in programming within functionally rich software applicationsExcellent communication skills in EnglishAvailable fulltimeFamiliarity with Source Control and test driven development is appreciatedYour talentsKnow how to have fun, can handle feedback and possess a sharp eye of consistencyYou like problem solving and challengesAbility to work well in a dynamic environment with a diversity of professionalsProfessional, enthusiastic, ambitiousInterested? We would like to meet you, show you our office and discuss your future career. Please send us your resume with contact details and we will set up a meeting with our development department in short notice. Email address: humanresources@onguard.com"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-back-end-lightspeed-JV_IC3064478_KO0,27_KE28,38.htm?jl=2883184372&ctt=1533887790101", "title": "Software Developer (Back-End)", "description": "Lets talk shop: Lightspeed is on the lookout for a passionate full-time Software Developer (Back-End) to join our Amsterdam-based Development team. The primary role for this position is to work on Lightspeeds eCommerce component, helping over 12 000 shops around the world grow their online business.  After starting your day with great coffee, you and your team will discuss your day to day activities. Then you will settle in to deploy multiple times a day while checking the logs for any discrepancies. Finally, you will celebrate your success with your team in our lively and social canal office on Herengracht in the heart of Amsterdam.  You will be working with a modern code base in an environment that is open to change. This will give you many opportunities to put yourself forward for exciting and challenging projects where you can showcase your strong technical skills. Working with your team, you will be a vital part of this at every step. Finally, as part of a full-stack team, you will be working with talented developers from different countries and will have the opportunity to learn and grow at Lightspeed.  Now we get to brag about us: Lightspeed provides retailers and restaurateurs the simplest way to build, manage, and grow their business while crafting a better customer experience. Lightspeed empowers small business owners with a complete overview of their business in one place - more than 50,000 businesses processing over $15 billion in transactions annually use Lightspeeds mobile Point of Sale software and newly acquired eCommerce platform to manage inventory, customer preferences, sales, and analytics to get a complete overview of their business in one place. Founded in 2005 with offices in Canada, USA, and Europe, Lightspeed is backed by Accel Partners, iNovia Capital, Caisse de dépôt et placement du Québec (CDPQ), and Investissement Québec (IQ). We're passionate about enabling people to do their best work. Come work with us and find out what you can do.  Heres a little song we wrote about you: you believe that continuous integration, deploying your code multiple times a day to production is how modern code should be produced, you are not scared of taking full ownership of the solution you have built including testing and verifying your code in production, and you enjoy celebrating success with your team. If you recognize yourself in this description, we think we should talk! Primary ResponsibilitiesDevelop next-generation scalable, flexible, and high-performance systemsWork as part of a full-stack team to deliver product features and functionalities to improve our eCommerce productTranslate requirements into conceptual and detailed designs with estimates in a large SaaS environmentDevelop clean, maintainable code in a continuous integration and continuous deployment environmentAssist QA and Support staff in troubleshooting software issues as well as implementing bug fixesRequirements3+ years experience developing reliable, highly available and scalable software (preferably in a scalable SaaS setting)Strong experience with object oriented languages (primarily PHP, and Java, Python or Ruby), knowing Design Patterns and identifying Single ResponsibilityBS/BA in Computer Science, or equivalent experienceExperience working in an Agile development environmentProven experience with MySQLExperience writing unit testsExperience with Git/GithubFluency in EnglishAssetsE-commerce and SaaS experienceExperience with RedisExperience with ElasticSearchExperience with LaravelExperience consuming and maintaining RESTful APIsExperience in a UNIX/Linux environmentFluency in DutchAnd when youre not programming? In addition to the perks you see in the Careers page, youll get access to: Ability to work with highly skilled people and grow within the global Lightspeed Development teamFlexible working hours - No punch in no punch out!Even if we became bigger everyone has an impact on the company as a wholeWe encourage initiatives and leadershipPossibility to work with state of the art technologiesTech talks - Sharing is caring :)Happy hour every Friday afternoonFun activities with your teammates - Be part of the Lightspeed Family!"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-software-engineer-g2v-recruitment-group-JV_IC3064478_KO0,36_KE37,58.htm?jl=2859091047&ctt=1533887790499", "title": "Software Developer / Software Engineer", "description": " My client based in Amsterdam require Software Engineers / Developers to form a newly made Blockchain team.  Blockchain experience is not essential for this role.  This position will allow you to work with the latest software and technologies within the industry.  A degree in computer science or related technology is ideally wanted as well as 2 + years of general software / development experience.  If you're interested please apply ASAP with your updated CV.  Thanks,  g2 Recruitment are committed to equality of opportunity for all applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships or any other characteristic protected by law"},
{"link": "https://www.glassdoor.nl/job-listing/graduate-software-developer-optiver-JV_IC3064478_KO0,27_KE28,35.htm?jl=2307623330&ctt=1533887790637", "title": "Graduate Software Developer", "description": " Do you envisage yourself working in a company that is at the cutting edge of technology, running a global network with thousands of high performance, low latency applications, dealing with petabytes of data every day? Would you like to work in a highly-skilled, passionate and driven environment where there is a high degree of freedom, responsibility and reward? Then you might be our new Graduate Software Developer! Technology at Optiver In order to be successful in our trading domain, we constantly need the most advanced technology, trading software and connections to the market. In short, we need the best technologists to develop, optimise and support our systems and tools. As a technologist, you are responsible for the full stack of applications and the full development life cycle, granting a lot of ownership. Collaborating with our traders, your software can be deployed in production the same day providing immediate results. Latency is crucial, which is why we make use of FPGAs and microwave links to ensure fast execution. With 12 datacenters and thousands of servers we run ten thousands of trading components executing hundred thousands of trades every day. What you'll do Depending on the team, you are responsible for the full stack of trading, control or central applications. In all teams you will be handling large sets of real time data, that require high performance and easily scalable systems. Your products need to provide the various business-units a dependable and rock-solid landscape to operate in.  Being part of our Trading Technology team means activities range from writing our automated trading strategies to developing ultra-low-latency exchange protocol encoders and decoders and helping our monitoring and analysis effort by creating user interfaces to provide the traders with more information and control.  Systems in our Control Technology team cover monitoring trading behavior, integrating our pre- and post-trade risk management with auto trading and processing the trade flow in order to do our P&amp;L management.  Being part of our Core Technology team means you provide the trading groups with the services for storage and distribution of critical data such as instrument-definitions, pricing-data, trades and positions and we are responsible for tools and utilities used for monitoring the live production environment. What you'll needUniversity degree in Computer Science, Computer Engineering or Information Systems;History of academic excellence;Proficient in C++, C# or Java;Knowledge of Python is a plus;Ambition to grow through training and on-the-job development;To be a team player with solid communication skills.What youll get As a Graduate Software Developer you will be joining our Tech Starters Program, which will provide you the unique opportunity to develop your technical and soft skills, enhancing your knowledge on trading and our business. You will be guided along the way by a senior developer assigned as your mentor. This is a once in a lifetime opportunity to jump start your career in the tech world/in software development.  Optiver is above all a state of mind. We are looking for you when you believe in daily improvement, when you like to be seriously rewarded for your performance and when you easily adapt to change and enjoy some humour and fun. To be concrete, we offer excellent remuneration and great secondary benefits, such as an attractive profit sharing structure, training opportunities, fully paid first-class commuting expenses, a premium-free pension, breakfast and lunch facilities, sports and leisure activities, even weekly chair massages and of course Friday afternoon drinks. We are used to guiding expats through their relocation and offer relocation packages and discounts on health insurance. Interested? The first step after applying for this job is an online (HackerRank) test assessing your programming fundamentals (in C++, C# and/or Java). No prior trading knowledge needed. Kindly note that we do not require any assistance from third-parties including agencies in the recruitment of this role."},
{"link": "https://www.glassdoor.nl/job-listing/senior-javascript-front-end-developer-adyen-JV_IC3064478_KO0,37_KE38,43.htm?jl=2673354079&ctt=1533887790603", "title": "Senior Javascript / Front End Developer", "description": " Adyen is growing fast and is therefore looking for Senior JavaScript / Front End Developers to add to our highly skilled team, wholl collectively push boundaries of the customer experience and technology at Adyen.  We are at the forefront of the global technology scene, providing our services to the world's leading innovative companies (Facebook, Spotify, Groupon, Evernote, Booking.com, Yelp, Vodafone, Mango and many more). We work in close partnership with these companies to ensure they are always ahead of the game. Guided by Fintech's most experienced software developers, we need you to contribute to the customer-facing component of our fast-growing platform that processes billions of transactions a year. We are looking for Were looking for people with side projects, people who love to check out codepen.io or open-source github repos, design systems and style guides. People who understand that shipping fast doesnt mean you ship bad quality (its not how you build it, but what you build), someone who can explain their job to their grandparents - after which they actually understand - and someone who gets all geeky about well-documented, great new frameworks or tools. Last but not least, were looking for people who think designers can be, should be (and maybe are?) their ultimate partner-in-crime.  An ideal candidate is a true ambassador of frontend development, is highly skilled with HTML, CSS and JavaScript - experience with D3 and/or Node.js would definitely be an advantage. You are experienced in building high performance, live web applications and you have no problem talking us through them. Youre familiar with complex high performance platforms and you have an eye for detail, you take ownership of your work, youre flexible and a team player (humility goes a long way, sometimes!). Also, you the ability to communicate clearly in English.  If multiple of these criteria hit the nail on the head, then lets chat! Our team The Adyen tech teams are full of passionate, talented and great engineers, designers and product managers and were looking to expand. As a senior javascript / frontend developer, youll be working on products that help our (over) 5000 merchants make payments all over the world.  You will be part of one of our 17 work streams (teams, squads, groups); like Customer Area, On-boarding (KYC) Market Pay, Data/Risk, Point-of-Sale, Local Payment Methods, Mobile, Finance or Acquiring. Within a work stream youll closely collaborate with colleagues from different disciplines, such as designers, account managers, data analysts and other developers. Youll work on challenging projects to innovate our web application platform and therefore benefit our customers (merchants). Youll be developing interactive components and user interfaces for internal and external system users. Your focus will be on frontend technologies, but you also understand backend enough to know how it works and how it communicates with a frontend. This is what you'll be doingWork on and be involved in conversations about architecture and core, code tools and librariesYoull write maintainable/shareable code with the ability to identify and resolve issues and bugs over a full stack environmentInvestigate new technical possibilities to keep the needle moving, while being pragmatic about where were at with existing frameworksShare knowledge with colleagues and companies all over the world (you preferably love to help out your colleagues)Have complete freedom and responsibility to make your own decisions in a fast pace environmentWe offer you We offer you having an impact from day one, a competitive salary, help with relocation and an exchange program to other offices around the world. What were actually most proud of is the fact we give you all the freedom you need to shape your own career path. Whether you want to move into a Sales position, take a training (internally or externally), develop yourself as a leader, get better at presenting or take a deep dive and specialise, we love any and every type of personal development and growth. Lets grow together!"},
{"link": "https://www.glassdoor.nl/job-listing/software-developer-ockto-JV_IC3063778_KO0,18_KE19,24.htm?jl=2838359572&ctt=1533887790881", "title": null, "description": " Were looking to enforce our team with a Software Developer, who can create and develop new concepts within Ockto and prepare them for an outsourced development team.  Weve been working with outsourced developers for years, and it works great! But, with our growth, its now time to have some more muscle on our in-house team. This will allow is to move quicker and be more agile, with the ultimate goal to produce software that matches our client's wishes even better.  As a Software Developer at Ockto, youre a true pioneer. Youll be exploring new ideas, technologies, and connections. Together with your colleagues, you will truely make an impact and bring our platform to a higher level. All of this, to be able to say later: I was part of the beginning of the Ockto success-story! What you will do:Work on the innovation and development of the Ockto platform (and so, the innovation of the entire financial sector);Pioneer with new technologies, like progressive web-apps;Come up with smart IT-solutions and realise them for top-financial organisations like ABN AMRO, Rabobank, Stater, Aegon and Volksbank;Work together with the Ockto scrum-teams to build the innovations youve came up with and get them in production for our clients.We offer a working environment where:Youll be working on exciting in-depth IT projects with high-tech solutions;Youll have concrete growing perspectives (a place where you get better);We respect a good work/life balance;We acknowledge your talents and allow you to apply them.Also, you can expect:A good salary;A Macbook Pro;Phone- and travel-allowance;A tailor made educational program;Collective insurances;A pension-scheme. The world is at your feet, and youre ready to conquer it. You want to live up to your full potential and are ready to go for it. No, is never an answer for you and you always search for the best possible solution. Youre confident and you can communicate your opinion. Also, we like you to have: A bachelor's degree (IT is a pre);Demonstratable knowledge or experience with Javascript;Knowledge about C#, ASP.NET and Xamarin is a pre;Youve been working in a relevant position for around 2 years;A flexible mindset, and natural curiosity that allows you to learn quickly about new technologies;Great communication skills, for internal and external stakeholders, also in English.About us Ockto is the online platform to collect and share personal data in a secure way. With the Ockto platform, consumers have access to their data that is be stored at De Belastingdienst, the UWV, MijnOverheid, but also banks and insurers. This information can then be shared with organisations that require it.  For example, Ockto makes getting a mortgage or check your pension-situation, easy and fast. It gives you quick insights in your financial status, without having to go through all the paperwork. That saves a lot of time and efforts!  Ockto was founded in 2015 by Yellowtail, has a fintech start-up culture and is run by a compact team. Most big banks and insurers are now connected to Ockto. The upcoming years, Ockto will grow rapidly and expand the platform significantly. Your data is safe At Ockto (and the other entities falling under Yellowtail Group) we use your motivation, CV and other data only during the application-process to review the candidate. Whenever the process ends, we only save your name and the way to found us for one more year. This is only to get insights on our recruiting channels. All other personal data will be deleted."},
{"link": "https://www.glassdoor.nl/job-listing/net-software-developer-netmatch-JV_IC3064478_KO0,22_KE23,31.htm?jl=2864736259&ctt=1533887790638", "title": ".NET Software Developer", "description": " Job descriptionYour challenge As a .NET web developer at NetMatch, you are responsible for the creation of the newest versions of websites and services of travel organizations. You design, build and test new and innovative solutions for our clients. Following this, you are involved in the further development of new features and in giving advice to fellow developers about the integration of the newly developed features into existing applications. You seek and discover new techniques and think of ways to expand and improve our customer solutions and architecture.  The high volume websites we create are built using the latest Microsoft technologies, contain many complex features and must be capable of processing large amounts of data. This means that you will work in challenging projects using the latest tools and technologies in web development, like .NET 4.6, .NET Core, MVC 5, Web API, Visual Studio 2017, SQL and Entity Framework. Specifically at our Amsterdam office, you can work on R&amp;D, Product Development and implementation projects. What do we expect from you?Higher education in computer science (or equivalent);Strong affinity with web development, backed by several years of work experience;Experience with C#, ASP.NET, MVC;Optional: experience with HTML, CSS and JavaScript. Additionally, you recognize yourself in the following profile: You currently reside in or around Amsterdam;You are proactive and take initiative;You have good communication skills;You are accurate.What can you expect from us? NetMatch is a software company that provides Travel Technology Solutions to European clients. Our focus is on the travel industry. NetMatch’ clients are major travel companies such as Corendon, Zoover and TUI Cruises.  Working at NetMatch means working in a dynamic, internationally oriented environment. You will be working in a highly motivated team of young people in an informal atmosphere. Our office is located in the center of Amsterdam (nearby Museumplein) with easy access to public transport. Besides the office in Amsterdam, we have offices in Tilburg and Cluj-Napoca (Romania). What do we offer?Challenging, in-house function (Amsterdam) with growth opportunities;Specialized, professional work environment;Good salary, depending on your experience and skills;Opportunities to follow training courses, obtain certificates and visit technology seminars;25 vacation days;Pension plan;Flexible working hours;Reimbursement of travel expenses;Social events with colleagues."},
{"link": "https://www.glassdoor.nl/job-listing/back-end-software-developer-navigationarts-JV_IC3064478_KO0,27_KE28,42.htm?jl=2857636041&ctt=1533887790473", "title": "Back-end Software Developer", "description": " Striving for excellence is in our DNA. Since 1993, we have been helping the world’s leading companies imagine, design, engineer, and deliver software and digital experiences that change the world. We are more than just specialists, we are experts. DESCRIPTION Currently we are looking for a Back-end Software Developer for our Amsterdam office to make the team even stronger.  For our Liberty Global we are seeking for a person who will be responsible for the full development lifecycle of the server components from architecture and design to development and integration with other back-office systems and partner products.  We encourage you to join to our Video Back Office Software Development Team and work on bringing the Liberty Global media products vision to life."},
{"link": "https://www.glassdoor.nl/job-listing/java-software-engineer-imc-financial-markets-JV_IC3064478_KO0,22_KE23,44.htm?jl=2630541042&ctt=1533887790386", "title": "Java Software Engineer", "description": "IMC - WHERE TECHNOLOGY DRIVES TRADING Trading nowadays happens in a highly competitive technological landscape; the best trading idea alone doesn’t cut it anymore. Instead, only the best trading ideas that are enabled via robust, scalable and fast technology win.  Do you enjoy the process of problem solving, a process where you recognize areas of improvement and iterate and innovate to improve? Does your curiosity and desire to learn drive you? SOFTWARE ENGINEERING AT IMC We trade in the most competitive markets across the globe. Our software makes millions of trading decisions daily. We win by making better and faster decisions than our competition. As a software developer you’ll be working alongside traders to implement strategies which will challenge you to be creative with your implementation. You’ll need to produce solutions which compete in the extremely latency sensitive environment, whilst managing complexity.  You’ll be working in a highly motivated team, controlling end-to-end product development. We work in an environment where slight oversights can be extremely costly, while new features can be extremely profitable. As a team we aim to balance the race to production with software quality and testability. You’ll be placed in an environment consisting primarily of C++ and Java. We have a build chain which has been designed around the concept of daily production releases. A variety of systems and technologies keeps life interesting.  Upon joining you will be expected to manage your own time and tasks. We rely on our developers to drive change by taking feedback from traders, and shaping that into an implementation. Your ownership of the task continues until a working production release. Our most successful developers comfortably work in any part of our stack WHAT MAKES IT FUN? One of the most fun aspects of the job is that we have a very quick feedback loop. We release early and often to get incremental benefits as they are developed. We operate at the bleeding edge of technology. If something new can potentially bring an advantage we will actively invest in developing and utilizing the solution  We really believe in sharing knowledge and technology between the different offices. Much of our technology stack is shared between all 3 regions, and we provide opportunities to travel between the regions both for personal growth and to assist where it has the biggest impact.  To get the best results we encourage everybody to gain understanding of both the trading strategy and how exchanges work on a technological level.  Working at IMC is also an opportunity to learn about financial markets. We know from experience that a lot of people really enjoy learning about a field beyond their immediate area of expertise, it’s one of the things that makes this job more interesting than others.  We employ a broad range of people with varying backgrounds. What they have in common is their superior technical expertise, their extraordinary smarts and their collaborative approach. We will not accept less. OUR CULTURE We are at the core a trading firm, however we value trading and technology equally and we believe that cooperation between traders and technologists is one of our great strengths. This is also reflected in our organizational and remuneration policies. We believe in fostering a truly flat environment in which great ideas can be recognized as well as put into practice from anybody within our organization WHO WE ARE IMC is among the world’s leading technology-driven trading firms, and a market maker in securities listed on exchanges across the globe. Our cutting-edge technology drives everything we do. High performance algorithms, smart strategies and collaborative teams are the core of our business.  Today, IMC is 500+ people working together to build software and trade financial products in our offices in Amsterdam, Chicago and Sydney. What does this mean for you? The chance to join a multi-national, multi-cultural team of exceptional individuals, focused on making IMC the world’s best trading firm."},
{"link": "https://www.glassdoor.nl/job-listing/fullstack-javascript-engineer-comscore-JV_IC3064478_KO0,29_KE30,38.htm?jl=2796321985&ctt=1533887790531", "title": "Fullstack JavaScript Engineer", "description": " Job DescriptioncomScore is a data company. We collect and process 60+ billion events each day, have 10s of petabytes online and each month our processes read nearly an exabyte. We use this capability to provide our clients with deep insights that no other company can match. The tagging team is working on cutting edge technologies for web, mobile and OTT applications. We are looking for a JavaScript Engineer to join our team. TITLE: Fullstack JavaScript Engineer LOCATION: Amsterdam, The Netherlands REPORTS TO: Director, Software Engineering Summary: In this role you will be contributing to the creation of new streaming plug-ins for 3rd party web players and maintaining existing JavaScript based tags. The successful candidate will have extensive knowledge about JavaScript and is able to demonstrate experience in developing code for multiple browsers including mobile and embedded environments.  We're looking for someone who is proud to show source code to peers, striving to develop the most reliable and efficient product. We are looking forward to hear about your skills. Your interviewers highly appreciate to see any work you have created and can share. Essential Duties and Responsibilities:We build data processing pipelines that handle 100+ terabyte datasetsWe automate as much as we can so that we can stay focused on writing codeWe troubleshoot and quickly resolve issuesWe continue to research for new technologies as the internet evolvesCore Qualifications:2 - 5 years of professional object-oriented programming experienceYou have a strong understanding of JavaScriptYou are fluent in EnglishYou understand the inner workings of the technologies involved in web applications (including but not limited to security, cookies, local storage and web services)You have a solid understanding of Computer Science fundamentals, software engineering principles and technologiesYou write good code and take pride in that fact regardless of which language you are currently usingYou enjoy working as a member of team and consider feedback a learning opportunityThe following are considered a plus:A good understanding of ActionScript3Used to working in an Agile environmentGood Python skillsExposure with Node.jsExperience with streaming media technologiesTechnologies we use:Previous experience in these technologies is not required. This is a great opportunity for someone looking for a new challenge.GruntGitJenskinsGradleAppiumBenefits:The possibility to surround yourself with exceptionally talented individuals, widely regarded as leaders in measuring the digital worldAccess to the latest tech gadgets and technologies as a part of your jobBe a part of a fun, friendly and a close teamInformal work atmosphereRoom for personal improvementFriendly, dedicated and driven colleaguesCompany fitness planCompetitive salary and benefitsAbout comScore:comScore is a leading cross-platform measurement company that measures audiences, brands and consumer behavior everywhere.comScore completed its merger with Rentrak Corporation in January 2016, to create the new model for a dynamic, cross-platform world. Built on precision and innovation, comScore’s data footprint combines proprietary digital, TV and movie intelligence with vast demographic details to quantify consumers’ multiscreen behavior at massive scale. This approach helps media companies monetize their complete audiences and allows marketers to reach these audiences more effectively. With more than 3,200 clients and a global footprint in more than 70 countries, comScore is delivering the future of measurement.Shares of comScore stock are currently traded on the OTC Market (OTC:SCOR).For more information on comScore, please visit comscore.com *LI-JL1"}
]